In [11]:
import pandas as pd

In [12]:
df_train_orig = pd.read_csv("train.csv")
df_test_orig = pd.read_csv("test.csv")

In [13]:
df_test_orig.shape

(418, 11)

In [14]:
df_train_orig.shape

(891, 12)

In [15]:
df_train_orig.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
df_test_orig.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
df_test_orig.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [18]:
df_test_orig['Sex'] = df_test_orig['Sex'].apply(lambda x : 1 if x == 'male' else 0)

In [19]:
df_test_orig.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
df_test_orig['Embarked'].value_counts()

Embarked
S    270
C    102
Q     46
Name: count, dtype: int64

### 1. 결측치를 포함한 행만 제거

행에서 결측치를 포함한 행들만 제거하려면 dropna()의 axis=0 (기본값) 설정을 사용합니다.

In [21]:
# 결측치를 포함한 행만 제거
# df.dropna(axis=0, inplace=True)

### 2. 결측치를 포함한 열만 제거
열에서 결측치를 포함한 열들만 제거하려면 dropna()의 axis=1 설정을 사용합니다.

In [22]:
# 결측치를 포함한 열만 제거
# df.dropna(axis=1, inplace=True)

- axis=1: 열 방향으로 결측치가 있는 경우 해당 열을 제거합니다.
### 조건을 지정하여 제거
- how='all': 모든 값이 결측치인 행 또는 열만 제거.
- how='any': 하나라도 결측치가 있는 행 또는 열을 제거 (기본값).
예를 들어, 열에서 모든 값이 결측치인 열만 제거하고 싶다면:

In [23]:
# df.dropna(axis=1, how='all', inplace=True)

### 데이터 전처리
#### 1. 결측치 처리
Sex, Cabin - 제거

그 외 - 평균값으로 메꾸기

-> cabin을 그렇다 쳐도 왜 Age까지 열을 통째로 제거했을까?

In [24]:
df_test = df_test_orig.drop(columns=['Age', 'Cabin'])           # 결측치가 너무 많은 데이터는 열을 채로 제거
df_train = df_train_orig.drop(columns=['Age', 'Cabin'])         # 결측치가 너무 많은 데이터는 열을 채로 제거

df_test['Fare'].fillna(df_test['Fare'].mean(), inplace=True)    # 요금값중에서 결측치가 있는 값들을 평균값으로 메꿨다.
df_train.dropna(inplace=True)                       # 1개정도라서 평균값으로 메꿀만 하지만. 수치형 데이터가 아니라서 일단은 제거했다.

/var/folders/6q/q927ypwn4ll9d4rvjq9gl1qw0000gn/T/ipykernel_82886/1888781965.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_test['Fare'].fillna(df_test['Fare'].mean(), inplace=True)    # 요금값중에서 결측치가 있는 값들을 평균값으로 메꿨다.

In [25]:
print(df_train.isnull().sum())
print(df_test.isnull().sum())
df_train.head()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64
PassengerId    0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,S

### 그 외의 쓸모없는 놈들 모두 없애자.
	PassengerId, Name, Ticket 제거

In [26]:
col_names = ['PassengerId', 'Name', 'Ticket']
df_train = df_train.drop(columns=col_names)
df_test = df_test.drop(columns=col_names)

### 왜 열의 갯수가 다를까? -> df_train에는 목표인 Survived열이 있기때문이다.

In [27]:
print(df_test.shape)
print(df_train.shape)

(418, 6)
(889, 7)

### Embarked와 Sex를 각각 인코딩. 각각 라벨인코딩 or 원핫인코딩 중 선택.

In [38]:
import numpy as np

In [41]:
from sklearn.preprocessing import OneHotEncoder

X = df_test[['Embarked']].values
embarked_ohe = OneHotEncoder()
embarked_ohe_array = embarked_ohe.fit_transform(X[:, 0].reshape(-1, 1)).toarray()
embarked_ohe_array

array([[0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       ...,
       [0., 0., 1.],
       [0., 0., 1.],
       [1., 0., 0.]])

In [42]:
embarked_ohe_df = pd.DataFrame(embarked_ohe_array, columns=['1', 'color', 'size'])

In [50]:
embarked_ohe_df = pd.get_dummies(df_test[['Embarked']])
embarked_ohe_df.head()

   Embarked_C  Embarked_Q  Embarked_S
0       False        True       False
1       False       False        True
2       False        True       False
3       False       False        True
4       False       False        True

In [53]:
embarked_ohe_df['Embarked_C'] = embarked_ohe_df['Embarked_C'].apply(lambda x : 1 if x == True else 0)
embarked_ohe_df['Embarked_Q'] = embarked_ohe_df['Embarked_Q'].apply(lambda x : 1 if x == True else 0)
embarked_ohe_df['Embarked_S'] = embarked_ohe_df['Embarked_S'].apply(lambda x : 1 if x == True else 0)

In [54]:
embarked_ohe_df

     Embarked_C  Embarked_Q  Embarked_S
0             0           1           0
1             0           0           1
2             0           1           0
3             0           0           1
4             0           0           1
..          ...         ...         ...
413           0           0           1
414           1           0           0
415           0           0           1
416           0           0           1
417           1           0           0

[418 rows x 3 columns]

In [56]:
preprocessed_df_test = pd.concat([df_test, embarked_ohe_df])
preprocessed_df_test.head()

,Pclass,Sex,SibSp,Parch,Fare,Embarked,Embarked_C,Embarked_Q,Embarked_S
0,3.0,1.0,0.0,0.0,7.8292,Q,NaN,NaN,NaN
1,3.0,0.0,1.0,0.0,7.0000,S,NaN,NaN,NaN
2,2.0,1.0,0.0,0.0,9.6875,Q,NaN,NaN,NaN
3,3.0,1.0,0.0,0.0,8.6625,S,NaN,NaN,NaN
4,3.0,0.0,1.0,1.0,12.2875,S,NaN,NaN,NaN